In [4]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [5]:
%cd '/content/drive/My Drive/Kaggle'

/content/drive/My Drive/Kaggle

In [6]:
import pandas as pd
import matplotlib.pyplot as plt

from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

df = pd.read_csv('titanic_train.csv')
df.head()

   passenger_id  pclass  ...                 home.dest survived
0          1216       3  ...                       NaN        1
1           699       3  ...                   Croatia        0
2          1267       3  ...                       NaN        0
3           449       2  ...      Cornwall / Akron, OH        1
4           576       2  ...  Barre, Co Washington, VT        0

[5 rows x 15 columns]

In [7]:
from sklearn.model_selection import train_test_split
import numpy as np

np.random.seed(42)

X = df.drop('survived', axis=1)
y = df.survived


X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

In [8]:
X_train.head()

     passenger_id  pclass  ...   body     home.dest
332          1060       3  ...    NaN           NaN
383           192       1  ...    NaN           NaN
281          1100       3  ...  206.0           NaN
2            1267       3  ...    NaN           NaN
231            10       1  ...  124.0  New York, NY

[5 rows x 14 columns]

In [9]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import LinearSVC, SVC

clf = RandomForestClassifier()

from sklearn.ensemble import RandomForestRegressor
rf_reg = RandomForestRegressor()

In [ ]:
# Make sure the data is numeric and not missing any values. 

clf.fit(X_train,y_train)

y_pred = clf.predict(X_test)

y_pred_prob = clf.predict_proba(X_test)

y_pred, y_pred_prob

In [ ]:
clf.fit(X_train,y_train)
clf.score(X_test,y_test)

In [10]:
from sklearn.model_selection import cross_val_score

cross_1 = cross_val_score(estimator=clf, 
                          X, y, cv=5, verbose=2, scoring=None)

cross_2 = cross_val_score(estimator= RandomForestClassifier(), 
                          X, 
                          y, 
                          cv=5, 
                          verbose=2, 
                          scoring='precision')

In [11]:
from sklearn.metrics import accuracy_score, classification_report 
from sklearn.metrics import roc_auc_score, roc_curve, confusion_matrix